<?php
    $day = 3;/*Как раз будет помогать выводить текст по этим цифрам*/
    switch ($day) {
        case 1:
            echo "Это рабочий день";/*Будет выводить этот текст при условии*/
            break;
        case 2:
            echo "Это рабочий день";/*Будет выводить этот текст при услови*/
            break;
        case 3:
            echo "Это рабочий день";/*Будет выводить этот текст при услови*/
            break;
        case 4:
            echo "Это рабочий день";/*Будет выводить этот текст при услови*/
            break;
        case 5:
            echo "Это рабочий день";/*Будет выводить этот текст при услови*/
            break;
        case 6:
            echo "Это выходной день";/*Будет выводить этот текст при услови*/
            break;
        case 7:
            echo "Это выходной день";/*Будет выводить этот текст при услови*/
            break;
        default:
            echo "Неизвестный день";/*Будет выводить этот текст при услови*/
            break;
    }
?>